src/AccountingRegisters/_ДемоОсновной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>_ДемоОсновной</Name>
			<ChartOfAccounts>ChartOfAccounts._ДемоОсновной</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts._ДемоОсновной.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/CalculationRegisters/_ДемоОсновныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<CalculationRegister>
		<Properties>
			<Name>_ДемоОсновныеНачисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister._ДемоГрафикиРаботы</Schedule>
			<ScheduleValue>InformationRegister._ДемоГрафикиРаботы.Resource.Значение</ScheduleValue>
			<ScheduleDate>InformationRegister._ДемоГрафикиРаботы.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes._ДемоОсновныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

src/Enums/ВариантыПубликацииДополнительныхОтчетовИОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВариантыПубликацииДополнительныхОтчетовИОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Используется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РежимОтладки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыДополнительныхОтчетовИОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДополнительныхОтчетовИОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДополнительнаяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеСвязанныхОбъектов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/_ДемоСтатусыЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>_ДемоСтатусыЗаказовПокупателей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/_ДемоЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>_ДемоЗаказПокупателя</Name>
			<BasedOn>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоВходящее</xr:Item>
				<xr:Item>Document.ТелефонныйЗвонок</xr:Item>
				<xr:Item>Document.Встреча</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef._ДемоСтатусыЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Comment>Внутренние значения полей адреса доставки (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаДоставки</Name>
					<Comment>Страна доставки, вычисленная из адреса (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионДоставки</Name>
					<Comment>Регион доставки, вычисленный из адреса (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородДоставки</Name>
					<Comment>Город доставки, вычисленный из адреса (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Comment>Внутренние значения полей электронной почты (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоменноеИмяСервера</Name>
					<Comment>Вычисленный домен почтового сервера (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаказЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СчетаНаОплату</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef._ДемоСчетНаОплатуПокупателю</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПартнерыИКонтактныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ДемоПартнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ДемоКонтактныеЛицаПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Comment>Тип</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Comment>Вид</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/_ДемоОбновлениеИнформационнойБазыБСП/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы демонстрационной конфигурации (БиблиотекаСтандартныхПодсистемДемо).
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).

// См. описание в общем модуле ОбновлениеИнформационнойБазыБСП.
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя = "БиблиотекаСтандартныхПодсистемДемо";
	Описание.Версия = "2.2.3.33";
	
	// Требуется библиотека стандартных подсистем.
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Монопольно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	// Обработчики, выполняемые при каждом обновлении ИБ
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.УправлениеОбработчиками = Истина;
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ВыполнятьВсегдаПриСменеВерсии";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ОбработчикСОшибкой";
	Обработчик.РежимВыполнения = "Монопольно";
	
	// Обработчики, выполняемые при заполнении пустой ИБ
	//
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ПервыйЗапуск";
	
	// Обработчики, выполняемые при заполнении пустой ИБ и при переходе на новую версию.
	//
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.2.2";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ИнициализироватьРолиИсполнителей";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.1.1.6";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ВыполнитьПервоначальноеЗаполнениеВалют";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.2.1.34";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ОбновитьПредопределенныеВидыКонтактнойИнформации";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.Приоритет = 99;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.2.2.10";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ОбновитьПредопределенныеКлючевыеОперации";
	
	Если Не ОбщегоНазначенияПовтИсп.РазделениеВключено() И Не ОбменДаннымиПовтИсп.ЭтоАвтономноеРабочееМесто() Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.НачальноеЗаполнение = Истина;
		Обработчик.Версия = "2.2.3.13";
		Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ЗагрузитьДополнительныеОтчетыИОбработкиИзОбщихМакетов";
	КонецЕсли;
	
	// Обработчики, выполняемые при переходе на новую версию.
	//
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.0.1.5";
	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ОбновитьДополнительныеОбработки_2_0_1_5";
	
	// Обработчики оперативного обновления
	//
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = Метаданные.Версия; // для целей тестирования
	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ЗаполнитьСтатусыЗаказовПокупателейЗаПоследнийМесяц";
	Обработчик.РежимВыполнения = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.2.1.28";
	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ЗаполнитьКонстантыДляОрганизаций";
	Обработчик.РежимВыполнения = "Оперативно";
	
	// Обработчики отложенного обновления
	//
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = Метаданные.Версия; // для целей тестирования
	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ТестированиеОтложенногоОбновления";
	Обработчик.Комментарий = НСтр("ru = 'Демонстрационный обработчик отложенного обновления данных.
		|Для имитации нештатной ситуации нажать на кнопку ""Имитировать ошибку при отложенном обновлении"" в инструменте разработчика и выполнить перезапуск программы.'");
	Обработчик.РежимВыполнения = "Отложенно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = Метаданные.Версия; // для целей тестирования
	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ЗаполнитьСтатусыЗаказовПокупателей";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение значения нового реквизита ""Статус заказа"" у документов ""Демо: Заказ покупателя"" прошлых периодов.'");
	Обработчик.РежимВыполнения = "Отложенно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.2.1.23";
	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ОбновитьПериодРегистрацииДокументовРасчета";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение значения нового реквизита ""Период регистрации"" у документов ""Демо: Начисление зарплаты"".'");
	Обработчик.РежимВыполнения = "Отложенно";
	
	ВариантыОтчетов.ДобавитьОбработчикиПолногоОбновления(Обработчики, "2.2.3.20");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.2.2.28";
	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ВосстановитьДвиженияДокументов";
	Обработчик.Комментарий = НСтр("ru = 'Перепроведение документов без движений по бухгалтерским и расчетным регистрам.'");
	Обработчик.РежимВыполнения = "Отложенно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.2.3.2";
	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ЗаполнитьПоследовательностьДвиженияТоваров";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение данных последовательности документов движения товаров.'");
	Обработчик.РежимВыполнения = "Отложенно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.2.3.26";
	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ЗаполнитьРеквизитГруппаДоступаУСправочниковГруппЗначенийДоступа";
	Обработчик.РежимВыполнения = "Оперативно";
	
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - если установить Истина, то будет выведена форма
//                                с описанием обновлений. По умолчанию, Истина.
//                                Возвращаемое значение.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//                                           или "*", если нужно выполнять при переходе с любой конфигурации.
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы ПредыдущееИмяКонфигурации. 
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.ПредыдущееИмяКонфигурации = "БиблиотекаСтандартныхПодсистемДемоБазовая";
	Обработчик.Процедура = "_ДемоОбновлениеИнформационнойБазыБСП.ПерейтиСБазовойВерсииНаПРОФ";
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, 
	Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
	Если ПредыдущееИмяКонфигурации = "ПредыдущееИмяКонфигурацииБазовая" Тогда
		Параметры.ВерсияКонфигурации = ПредыдущаяВерсияКонфигурации;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Заполнение пустой ИБ

// Демонстрирует процедуру-обработчик обновления и первоначального заполнения
// данных ИБ, которая выполняется однократно при переходе на версию 1.0.0.0.
//
Процедура ПервыйЗапуск() Экспорт
	
	// Код для первоначального заполнения информационной базы.
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обновление ИБ

// Демонстрирует процедуру-обработчик обновления данных ИБ, 
// которая выполняется каждый раз при смене версии конфигурации.
//
Процедура ВыполнятьВсегдаПриСменеВерсии(Параметры = Неопределено) Экспорт
	
	// Проверка необходимости обновления критичных общих данных
	ТребуетсяОбновитьКритичныеОбщиеДанные = Ложь;
	// Конец Проверка необходимости обновления критичных общих данных
	Если ТребуетсяОбновитьКритичныеОбщиеДанные Тогда
		Если Параметры <> Неопределено И НЕ Параметры.МонопольныйРежим Тогда
			Параметры.МонопольныйРежим = Истина;
			Возврат;
		КонецЕсли;
		// Код обновления критичных общих данных
	КонецЕсли;
	
КонецПроцедуры

// Демо-пример установки значений реквизитов предопределенных элементов справочника 
// РолиИсполнителей.
//
Процедура ИнициализироватьРолиИсполнителей() Экспорт
	
	РольОбъект = Справочники.РолиИсполнителей._ДемоРуководительКомпании.ПолучитьОбъект();
	РольОбъект.ИспользуетсяБезОбъектовАдресации = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РольОбъект);
	
	РольОбъект = Справочники.РолиИсполнителей._ДемоГлавныйБухгалтер.ПолучитьОбъект();
	РольОбъект.ИспользуетсяБезОбъектовАдресации = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РольОбъект);
	
	РольОбъект = Справочники.РолиИсполнителей._ДемоРуководительПодразделения.ПолучитьОбъект();
	РольОбъект.ИспользуетсяСОбъектамиАдресации = Истина;
	РольОбъект.ТипыОсновногоОбъектаАдресации = ПланыВидовХарактеристик.ОбъектыАдресацииЗадач._ДемоРуководительПодразделения;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РольОбъект);
	
	РольОбъект = Справочники.РолиИсполнителей._ДемоРуководительПроекта.ПолучитьОбъект();
	РольОбъект.ИспользуетсяСОбъектамиАдресации = Истина;
	РольОбъект.ТипыОсновногоОбъектаАдресации = ПланыВидовХарактеристик.ОбъектыАдресацииЗадач._ДемоРуководительПроекта;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РольОбъект);
	
КонецПроцедуры

// Процедура выполняет заполнение справочника Валюты для новой области данных
//
Процедура ВыполнитьПервоначальноеЗаполнениеВалют() Экспорт
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		СписокВалют = Новый Массив; 
		СписокВалют.Добавить("840");
		СписокВалют.Добавить("643");
		СписокВалют.Добавить("978");
		
		Ссылки = РаботаСКурсамиВалют.ДобавитьВалютыПоКоду(СписокВалют);
		
	КонецЕсли;

КонецПроцедуры

// Конвертация имен разделов на ссылки справочника ИОМ 
// для подсистемы "Дополнительные отчеты и обработки"
//
Процедура ОбновитьДополнительныеОбработки_2_0_1_5() Экспорт
	СоответствиеИменКомандРазделам = Новый Соответствие;
	
	СоответствиеИменКомандРазделам.Вставить(
		"_ДемоДополнительныеОбработкиРабочийСтол", 
		ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола());
	
	СоответствиеИменКомандРазделам.Вставить(
		"_ДемоДополнительныеОбработкиАдминистрирование", 
		Метаданные.Подсистемы.Администрирование);
	
	СоответствиеИменКомандРазделам.Вставить(
		"_ДемоДополнительныеОбработкиИнтегрируемыеПодсистемы", 
		Метаданные.Подсистемы._ДемоИнтегрируемыеПодсистемы);
	
	СоответствиеИменКомандРазделам.Вставить(
		"_ДемоДополнительныеОтчетыРабочийСтол", 
		ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола());
	
	СоответствиеИменКомандРазделам.Вставить(
		"_ДемоДополнительныеОтчетыАдминистрирование", 
		Метаданные.Подсистемы.Администрирование);
	
	СоответствиеИменКомандРазделам.Вставить(
		"_ДемоДополнительныеОтчетыИнтегрируемыеПодсистемы", 
		Метаданные.Подсистемы._ДемоИнтегрируемыеПодсистемы);
	
	ДополнительныеОтчетыИОбработки.ЗаменитьИменаРазделовНаИдентификаторы(СоответствиеИменКомандРазделам);
КонецПроцедуры

// Демонстрирует процедуру-обработчик обновления и первоначального заполнения
// данных ИБ, которая выполняет обновление данных подсистемы "Дополнительные отчеты и обработки"
// из-за изменения состава и формата вызова обработок.
//
Процедура ЗагрузитьДополнительныеОтчетыИОбработкиИзОбщихМакетов() Экспорт
	
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаОбработок.Расширение КАК Расширение,
	|	ТаблицаОбработок.СтароеИмяФайла КАК СтароеИмяФайла,
	|	ТаблицаОбработок.ИмяМакета КАК ИмяМакета
	|ПОМЕСТИТЬ ТаблицаОбработок
	|ИЗ
	|	&ТаблицаОбработок КАК ТаблицаОбработок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОбработок.Расширение КАК Расширение,
	|	ТаблицаОбработок.ИмяМакета КАК ИмяМакета,
	|	ЕСТЬNULL(НайденПоИмениОбъекта.Ссылка, НайденПоИмениФайла.Ссылка) КАК Ссылка,
	|	ЕСТЬNULL(НайденПоИмениОбъекта.Версия, НайденПоИмениФайла.Версия) КАК Версия
	|ИЗ
	|	ТаблицаОбработок КАК ТаблицаОбработок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки КАК НайденПоИмениФайла
	|		ПО ТаблицаОбработок.СтароеИмяФайла = НайденПоИмениФайла.ИмяФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки КАК НайденПоИмениОбъекта
	|		ПО ТаблицаОбработок.ИмяМакета = НайденПоИмениОбъекта.ИмяОбъекта";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	ТаблицаОбработок = Новый ТаблицаЗначений();
	ТаблицаОбработок.Колонки.Добавить("Расширение",     Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(3, ДопустимаяДлина.Переменная)));
	ТаблицаОбработок.Колонки.Добавить("СтароеИмяФайла", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(260, ДопустимаяДлина.Переменная)));
	ТаблицаОбработок.Колонки.Добавить("ИмяМакета",      Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	
	// Текущее имя файла образовывается от имени макета и расширения
	СтрокаТаблицы = ТаблицаОбработок.Добавить();
	СтрокаТаблицы.ИмяМакета      = "_ДемоДополнительнаяОбработка";
	СтрокаТаблицы.СтароеИмяФайла = "ДополнительнаяОбработка.epf";
	СтрокаТаблицы.Расширение     = "epf";
	
	СтрокаТаблицы = ТаблицаОбработок.Добавить();
	СтрокаТаблицы.ИмяМакета      = "_ДемоДополнительныйОтчет";
	СтрокаТаблицы.СтароеИмяФайла = "ДополнительныйОтчет.erf";
	СтрокаТаблицы.Расширение     = "erf";
	
	СтрокаТаблицы = ТаблицаОбработок.Добавить();
	СтрокаТаблицы.ИмяМакета      = "_ДемоДополнительнаяОбработкаЗаполненияНазначаемая";
	СтрокаТаблицы.СтароеИмяФайла = "ЗаполнениеОбъекта.epf";
	СтрокаТаблицы.Расширение     = "epf";
	
	СтрокаТаблицы = ТаблицаОбработок.Добавить();
	СтрокаТаблицы.ИмяМакета      = "_ДемоДополнительнаяОбработкаЗагрузкаИзФайла";
	СтрокаТаблицы.СтароеИмяФайла = "ЗагрузкаИзФайла.epf";
	СтрокаТаблицы.Расширение     = "epf";
	
	СтрокаТаблицы = ТаблицаОбработок.Добавить();
	СтрокаТаблицы.ИмяМакета      = "_ДемоДополнительнаяОбработкаПечатиMSWordНазначаемая";
	СтрокаТаблицы.СтароеИмяФайла = "Печать_MSWord_OO.epf";
	СтрокаТаблицы.Расширение     = "epf";
	
	СтрокаТаблицы = ТаблицаОбработок.Добавить();
	СтрокаТаблицы.ИмяМакета      = "_ДемоДополнительнаяОбработкаПечатиMXLНазначаемая";
	СтрокаТаблицы.СтароеИмяФайла = "Печать_MXL.epf";
	СтрокаТаблицы.Расширение     = "epf";
	
	СтрокаТаблицы = ТаблицаОбработок.Добавить();
	СтрокаТаблицы.ИмяМакета      = "_ДемоДополнительнаяОбработкаСозданияСвязанныхОбъектовНазначаемая";
	СтрокаТаблицы.СтароеИмяФайла = "СозданиеСвязанныхОбъектов.epf";
	СтрокаТаблицы.Расширение     = "epf";
	
	СтрокаТаблицы = ТаблицаОбработок.Добавить();
	СтрокаТаблицы.ИмяМакета      = "_ДемоДополнительныйОтчетНазначаемый";
	СтрокаТаблицы.СтароеИмяФайла = "Отчет.erf";
	СтрокаТаблицы.Расширение     = "erf";
	
	СтрокаТаблицы = ТаблицаОбработок.Добавить();
	СтрокаТаблицы.ИмяМакета      = "_ДемоДополнительнаяОбработкаЗагрузкаПрайсЛиста";
	СтрокаТаблицы.СтароеИмяФайла = "ЗагрузкаПрайсЛиста.epf";
	СтрокаТаблицы.Расширение     = "epf";
	
	СтрокаТаблицы = ТаблицаОбработок.Добавить();
	СтрокаТаблицы.ИмяМакета      = "_ДемоДополнительнаяОбработкаЗагрузкаПрайсЛистаВБезопасномРежиме";
	СтрокаТаблицы.СтароеИмяФайла = "ЗагрузкаПрайсЛистаВБезопасномРежиме.epf";
	СтрокаТаблицы.Расширение     = "epf";
	
	Запрос.УстановитьПараметр("ТаблицаОбработок", ТаблицаОбработок);
	
	АдминистраторСистемы = Справочники.Пользователи.НайтиПоНаименованию("Администратор");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДвоичныеДанные    = ПолучитьОбщийМакет(Выборка.ИмяМакета);
		АдресДанных       = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		Менеджер          = ?(Выборка.Расширение = "erf", ВнешниеОтчеты, ВнешниеОбработки);
		ИмяОбъекта        = Менеджер.Подключить(АдресДанных, , Истина);
		ВнешнийОбъект     = Менеджер.Создать(ИмяОбъекта);
		ОбработкаСведения = ВнешнийОбъект.СведенияОВнешнейОбработке();
		
		Если Выборка.Версия = ОбработкаСведения.Версия Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбработкаСведения.Наименование = Неопределено ИЛИ ОбработкаСведения.Информация = Неопределено Тогда
			ВнешнийОбъектМетаданные = ВнешнийОбъект.Метаданные();
			Если ОбработкаСведения.Наименование = Неопределено Тогда
				ОбработкаСведения.Наименование = ВнешнийОбъектМетаданные.Представление();
			КонецЕсли;
			Если ОбработкаСведения.Информация = Неопределено Тогда
				ОбработкаСведения.Информация = ВнешнийОбъектМетаданные.Комментарий;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Иначе
			СправочникОбъект = Справочники.ДополнительныеОтчетыИОбработки.СоздатьЭлемент();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СправочникОбъект, ОбработкаСведения, "Наименование, БезопасныйРежим, Версия, Информация");
		
		СправочникОбъект.Публикация = Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется;
		СправочникОбъект.Вид        = ДополнительныеОтчетыИОбработки.ПолучитьВидОбработкиПоСтроковомуПредставлениюВида(
			ОбработкаСведения.Вид);
		
		СправочникОбъект.ИспользоватьДляФормыОбъекта = Истина;
		СправочникОбъект.ИспользоватьДляФормыСписка  = Истина;
		СправочникОбъект.Ответственный               = АдминистраторСистемы;
		СправочникОбъект.ХранилищеОбработки          = Новый ХранилищеЗначения(ДвоичныеДанные);
		СправочникОбъект.ИмяОбъекта                  = Выборка.ИмяМакета;
		СправочникОбъект.ИмяФайла                    = Выборка.ИмяМакета + "." + Выборка.Расширение;
		
		СправочникОбъект.ИспользуетХранилищеВариантов = Ложь;
		Если СправочникОбъект.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет Тогда
			Если Метаданные.ХранилищеВариантовОтчетов <> Неопределено
				И Метаданные.ХранилищеВариантовОтчетов.Имя = "ХранилищеВариантовОтчетов" Тогда
				СправочникОбъект.ИспользуетХранилищеВариантов = Истина;
			Иначе
				ВнешнийОбъектМетаданные = ВнешнийОбъект.Метаданные();
				Если ВнешнийОбъектМетаданные.ХранилищеВариантов <> Неопределено
					И ВнешнийОбъектМетаданные.ХранилищеВариантов.Имя = "ХранилищеВариантовОтчетов" Тогда
					СправочникОбъект.ИспользуетХранилищеВариантов = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		СправочникОбъект.Команды.Очистить();
		
		Для Каждого КомандаОписание Из ОбработкаСведения.Команды Цикл
			
			Попытка
				ВариантЗапуска = ПредопределенноеЗначение("Перечисление.СпособыВызоваДополнительныхОбработок." + КомандаОписание.Использование);
			Исключение
				ВариантЗапуска = Неопределено;
			КонецПопытки;
			
			Если НЕ ЗначениеЗаполнено(ВариантЗапуска) Тогда
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Для команды ""%1"" не определен способ запуска.'"),
					КомандаОписание.Представление);
			КонецЕсли;
			
			Команда = СправочникОбъект.Команды.Добавить();
			ЗаполнитьЗначенияСвойств(Команда, КомандаОписание);
			Команда.ВариантЗапуска = ВариантЗапуска;
			
		КонецЦикла;
		
		Если ДополнительныеОтчетыИОбработки.ПроверитьГлобальнаяОбработка(СправочникОбъект.Вид) Тогда
			Назначение = ДополнительныеОтчетыИОбработки.НазначаемыеОбъектыМетаданныхПоВидуВнешнегоОбъекта(СправочникОбъект.Вид);
			Для Каждого СтрокаТаблицы Из Назначение Цикл
				РазделСсылка = СтрокаТаблицы.ОбъектНазначения;
				СтрокаРаздела = СправочникОбъект.Разделы.Найти(РазделСсылка, "Раздел");
				Если СтрокаРаздела = Неопределено Тогда
					СтрокаРаздела = СправочникОбъект.Разделы.Добавить();
					СтрокаРаздела.Раздел = РазделСсылка;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого ОписаниеНазначения Из ОбработкаСведения.Назначение Цикл
				ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ОписаниеНазначения);
				Если ОбъектМетаданных = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ОбъектНазначенияСсылка = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектМетаданных);
				СтрокаНазначения = СправочникОбъект.Назначение.Найти(ОбъектНазначенияСсылка, "ОбъектНазначения");
				Если СтрокаНазначения = Неопределено Тогда
					СтрокаНазначения = СправочникОбъект.Назначение.Добавить();
					СтрокаНазначения.ОбъектНазначения = ОбъектНазначенияСсылка;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ОбработкаСведения.Свойство("ВерсияБСП") Тогда
			Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ОбработкаСведения.ВерсияБСП, "2.2.2.0") > 0 Тогда
				СправочникОбъект.РежимСовместимостиРазрешений = Перечисления.РежимыСовместимостиРазрешенийДополнительныхОтчетовИОбработок.Версия_2_2_2;
			Иначе
				СправочникОбъект.РежимСовместимостиРазрешений = Перечисления.РежимыСовместимостиРазрешенийДополнительныхОтчетовИОбработок.Версия_2_1_3;
			КонецЕсли;
		Иначе
			СправочникОбъект.РежимСовместимостиРазрешений = Перечисления.РежимыСовместимостиРазрешенийДополнительныхОтчетовИОбработок.Версия_2_1_3;
		КонецЕсли;
		
		СправочникОбъект.Разрешения.Очистить();
		Разрешения = Неопределено;
		Если ОбработкаСведения.Свойство("Разрешения", Разрешения) Тогда
			
			Для Каждого Разрешение Из Разрешения Цикл
				
				ТипXDTO = Разрешение.Тип();
				
				СтрокаТЧ = СправочникОбъект.Разрешения.Добавить();
				СтрокаТЧ.ВидРазрешения = ТипXDTO.Имя;
				
				Параметры = Новый Структура();
				
				Для Каждого СвойствоXDTO Из ТипXDTO.Свойства Цикл
					
					Параметры.Вставить(СвойствоXDTO.Имя,
						Разрешение.ПолучитьXDTO(СвойствоXDTO.Имя).Значение);
					
				КонецЦикла;
				
				СтрокаТЧ.Параметры = Новый ХранилищеЗначения(Параметры);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если СправочникОбъект.ЭтоНовый() Тогда
			СправочникОбъект.Записать();
		Иначе
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
		КонецЕсли;
		
	КонецЦикла;
#КонецЕсли
	
КонецПроцедуры

// Обновляет значения реквизитов предопределенных видов контактной информации
Процедура ОбновитьПредопределенныеВидыКонтактнойИнформации() Экспорт
	
	ПараметрыПроверкиАдреса = Новый Структура;
	ПараметрыПроверкиАдреса.Вставить("АдресТолькоРоссийский", Истина);
	ПараметрыПроверкиАдреса.Вставить("ПроверятьКорректность", Ложь);
	ПараметрыПроверкиАдреса.Вставить("ЗапрещатьВводНекорректного", Ложь);
	ПараметрыПроверкиАдреса.Вставить("СкрыватьНеактуальныеАдреса", Ложь);
	ПараметрыПроверкиАдреса.Вставить("ВключатьСтрануВПредставление", Ложь);
	
	ПараметрыПроверкиEmail = Новый Структура;
	ПараметрыПроверкиEmail.Вставить("ПроверятьКорректность", Истина);
	ПараметрыПроверкиEmail.Вставить("ЗапрещатьВводНекорректного", Истина);
	
	// Справочник "Пользователи"
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ТелефонПользователя, Перечисления.ТипыКонтактнойИнформации.Телефон,
		НСтр("ru='Телефон пользователя'"), Истина, Ложь, Ложь, 1);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.EmailПользователя, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
		НСтр("ru='Адрес электронной почты пользователя'"), Истина, Ложь, Ложь, 2, Истина, ПараметрыПроверкиEmail);
		
	// Справочник "Организации"
	ПараметрыПроверкиЮрАдреса = Новый Структура;
	ПараметрыПроверкиЮрАдреса.Вставить("АдресТолькоРоссийский", Истина);
	ПараметрыПроверкиЮрАдреса.Вставить("ПроверятьКорректность", Истина);
	ПараметрыПроверкиЮрАдреса.Вставить("ЗапрещатьВводНекорректного", Истина);
	ПараметрыПроверкиЮрАдреса.Вставить("СкрыватьНеактуальныеАдреса", Ложь);
	ПараметрыПроверкиЮрАдреса.Вставить("ВключатьСтрануВПредставление", Ложь);
	
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, Перечисления.ТипыКонтактнойИнформации.Адрес,
		НСтр("ru='Юридический адрес организации'"), Истина, Ложь, Ложь, 1,, ПараметрыПроверкиЮрАдреса);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации, Перечисления.ТипыКонтактнойИнформации.Адрес,
		НСтр("ru='Фактический адрес организации'"), Истина, Ложь, Ложь, 2);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации, Перечисления.ТипыКонтактнойИнформации.Адрес,
		НСтр("ru='Почтовый адрес организации'"), Истина, Ложь, Ложь, 3);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации, Перечисления.ТипыКонтактнойИнформации.Телефон,
		НСтр("ru='Телефон организации'"), Истина, Ложь, Ложь, 4);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.EmailОрганизации, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
		НСтр("ru='Адрес электронной почты организации'"), Истина, Ложь, Ложь, 5, Истина, ПараметрыПроверкиEmail);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ФаксОрганизации, Перечисления.ТипыКонтактнойИнформации.Факс,
		НСтр("ru='Факс организации'"), Истина, Ложь, Ложь, 6);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияОрганизации, Перечисления.ТипыКонтактнойИнформации.Другое,
		НСтр("ru='Прочая информация'"), Истина, Ложь, Ложь, 7);
	
	// Справочник "Партнеры"
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации._ДемоАдресПартнера,   Перечисления.ТипыКонтактнойИнформации.Адрес,
		НСтр("ru='Адрес партнера'"), Истина, Ложь, Ложь, 1);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации._ДемоТелефонПартнера, Перечисления.ТипыКонтактнойИнформации.Телефон,
		НСтр("ru='Телефон партнера'"), Истина, Ложь, Ложь, 2);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации._ДемоEmailПартнера,   Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
		НСтр("ru='Адрес электронной почты партнера'"), Истина, Ложь, Ложь, 3, Истина, ПараметрыПроверкиEmail);
	
	// Справочник "Контактные лица партнеров"
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации._ДемоАдресКонтактногоЛица, Перечисления.ТипыКонтактнойИнформации.Адрес,
		НСтр("ru='Адрес контактного лица партнера'"), Истина, Ложь, Ложь, 1);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации._ДемоEmailКонтактногоЛица, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
		НСтр("ru='Адрес электронной почты контактного лица партнера'"), Истина, Ложь, Ложь, 2, Истина);
	
	// Справочник "Контрагенты"
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации._ДемоАдресКонтрагента, Перечисления.ТипыКонтактнойИнформации.Адрес,
		НСтр("ru='Адрес контрагента'"), Истина, Ложь, Ложь, 1,, ПараметрыПроверкиАдреса);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации._ДемоEmailКонтрагента, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
		НСтр("ru='Адрес электронной почты контрагента'"), Истина, Ложь, Ложь, 2, Истина);
	
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации._ДемоПартнерыИКонтактныеЛицаАдресПартнера, Перечисления.ТипыКонтактнойИнформации.Адрес,
		НСтр("ru='Адрес партнера'"), Истина, Ложь, Ложь, 1);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации._ДемоПартнерыИКонтактныеЛицаТелефонПартнера, Перечисления.ТипыКонтактнойИнформации.Телефон,
		НСтр("ru='Телефон партнера'"), Истина, Ложь, Ложь, 2);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации._ДемоПартнерыИКонтактныеЛицаEmailПартнера, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
		НСтр("ru='Адрес электронной почты партнера'"), Истина, Ложь, Ложь, 3);
	
	// Документ Заказ покупателя"
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации._ДемоПартнерыИКонтактныеЛицаАдресПартнера, Перечисления.ТипыКонтактнойИнформации.Адрес,
		НСтр("ru='Адрес партнера'"), Истина, Ложь, Ложь, 1);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации._ДемоПартнерыИКонтактныеЛицаТелефонПартнера, Перечисления.ТипыКонтактнойИнформации.Телефон,
		НСтр("ru='Телефон партнера'"), Истина, Ложь, Ложь, 2);
	УправлениеКонтактнойИнформацией.ОбновитьВидКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации._ДемоПартнерыИКонтактныеЛицаEmailПартнера, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
		НСтр("ru='Адрес электронной почты партнера'"), Истина, Ложь, Ложь, 3);
	
КонецПроцедуры

// Тестовый обработчик, предназначенный для имитации ошибки при обновлении.
//
Процедура ОбработчикСОшибкой() Экспорт
	
	ИмитироватьОшибку = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ОбновлениеИБ", "ИмитироватьОшибкуПриОбновлении", , ИмяПользователя());
	Если ИмитироватьОшибку = Истина Тогда
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ОбновлениеИБ",
			"ИмитироватьОшибкуПриОбновлении", Ложь, ИмяПользователя());
		ТекстСообщения = НСтр("ru = 'Процедура ОбработчикСОшибкой выполнилась с ошибкой.'");
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,,,
			ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

// Заполнить значение нового реквизита СтатусЗаказа у документов _ДемоЗаказПокупателя за последний месяц.
// 
Процедура ЗаполнитьСтатусыЗаказовПокупателейЗаПоследнийМесяц() Экспорт
	
	// Выбрать все заказы покупателя с неинициализированным значением нового реквизита.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	_ДемоЗаказПокупателя.Ссылка
	|ИЗ
	|	Документ._ДемоЗаказПокупателя КАК _ДемоЗаказПокупателя
	|ГДЕ
	|	_ДемоЗаказПокупателя.Дата >= &НачалоМесяца
	|	И _ДемоЗаказПокупателя.СтатусЗаказа = &ПустаяСсылка";
	
	Запрос.Параметры.Вставить("НачалоМесяца", ТекущаяДатаСеанса() - 30 * 24 * 60 * 60); // за последний месяц
	Запрос.Параметры.Вставить("ПустаяСсылка", Перечисления._ДемоСтатусыЗаказовПокупателей.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Для Каждого ЗаказПокупателя Из РезультатЗапроса Цикл
		
		Попытка
			ЗаполнитьСтатусЗаказаПокупателя(ЗаказПокупателя);
		Исключение
			// Если не удалось обработать какой-либо заказ, пропускаем и обрабатываем позднее (отложенно).
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось обработать заказ покупателя: %1 по причине:
					|%2'"), 
					ЗаказПокупателя.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Документы._ДемоЗаказПокупателя, ЗаказПокупателя.Ссылка, ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполнить значение констант ИспользоватьНесколькоОрганизаций и _ДемоОсновнаяОрганизация.
// 
Процедура ЗаполнитьКонстантыДляОрганизаций() Экспорт
	
	Константы.ИспользоватьНесколькоОрганизаций.Установить(Справочники.Организации.КоличествоОрганизаций() > 1);
	Константы._ДемоОсновнаяОрганизация.Установить(Справочники.Организации.ОрганизацияПоУмолчанию());
	
КонецПроцедуры

// Обновляет значения реквизитов предопределенных ключевых операций
Процедура ОбновитьПредопределенныеКлючевыеОперации() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлючевыеОперации.Ссылка,
	               |	КлючевыеОперации.ИмяПредопределенныхДанных
	               |ИЗ
	               |	Справочник.КлючевыеОперации КАК КлючевыеОперации
	               |ГДЕ
	               |	КлючевыеОперации.Имя = """"
	               |	И КлючевыеОперации.Предопределенный";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		КлючеваяОперация = Выборка.Ссылка.ПолучитьОбъект();
		КлючеваяОперация.Имя = Выборка.ИмяПредопределенныхДанных;
		КлючеваяОперация.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Заполнить реквизит ГруппаДоступа у справочников содержащих группы значений доступа,
// в данном случае у справочников _ДемоГруппыДоступаНоменклатуры, _ДемоГруппыДоступаПартнеров,
// чтобы использовать ограничение доступа этих справочников.
Процедура ЗаполнитьРеквизитГруппаДоступаУСправочниковГруппЗначенийДоступа() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	_ДемоГруппыДоступаНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник._ДемоГруппыДоступаНоменклатуры КАК _ДемоГруппыДоступаНоменклатуры
	|ГДЕ
	|	_ДемоГруппыДоступаНоменклатуры.ГруппаДоступа <> _ДемоГруппыДоступаНоменклатуры.Ссылка
	|	И НЕ _ДемоГруппыДоступаНоменклатуры.ЭтоГруппа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_ДемоГруппыДоступаПартнеров.Ссылка
	|ИЗ
	|	Справочник._ДемоГруппыДоступаПартнеров КАК _ДемоГруппыДоступаПартнеров
	|ГДЕ
	|	_ДемоГруппыДоступаПартнеров.ГруппаДоступа <> _ДемоГруппыДоступаПартнеров.Ссылка
	|	И НЕ _ДемоГруппыДоступаПартнеров.ЭтоГруппа";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.ГруппаДоступа = Объект.Ссылка;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект);
	КонецЦикла;
	
КонецПроцедуры

// Пример обработчиков отложенного обновления

// Заполнить значение нового реквизита СтатусЗаказа у документа _ДемоЗаказПокупателя.
// 
Процедура ЗаполнитьСтатусыЗаказовПокупателей(Параметры) Экспорт
	
	// получаем ранее сохраненную дату обработанных документов
	ДатаОбработанныхДокументов = Неопределено;
	Параметры.Свойство("ДатаОбработанныхДокументов", ДатаОбработанныхДокументов);
	
	// Выбрать все заказы покупателя с неинициализированным значением нового реквизита.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 50
	|	_ДемоЗаказПокупателя.Ссылка,
	|	_ДемоЗаказПокупателя.Дата
	|ИЗ
	|	Документ._ДемоЗаказПокупателя КАК _ДемоЗаказПокупателя
	|ГДЕ
	|	_ДемоЗаказПокупателя.СтатусЗаказа = &ПустаяСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	_ДемоЗаказПокупателя.Дата УБЫВ";
	
	Запрос.Параметры.Вставить("ПустаяСсылка", Перечисления._ДемоСтатусыЗаказовПокупателей.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Параметры.ОбработкаЗавершена = Ложь;
	
	ПроблемныхОбъектов = 0;
	ОбъектовОбработано = 0;
	
	Для Каждого ЗаказПокупателя Из РезультатЗапроса Цикл
		
		Попытка
			
			ЗаполнитьСтатусЗаказаПокупателя(ЗаказПокупателя);
			ДатаОбработанныхДокументов = ЗаказПокупателя.Дата;
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
		Исключение
			// Если не удалось обработать какой-либо заказ, повторяем попытку снова.
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось обработать заказ покупателя: %1 по причине:
					|%2'"), 
					ЗаказПокупателя.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Документы._ДемоЗаказПокупателя, ЗаказПокупателя.Ссылка, ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбъектовОбработано = 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процедуре ЗаполнитьСтатусыЗаказовПокупателей не удалось обработать некоторые заказы покупателей (пропущены): %1'"), 
				ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		Параметры.Вставить("ДатаОбработанныхДокументов", ДатаОбработанныхДокументов);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
			Метаданные.Документы._ДемоЗаказПокупателя,,
				НСтр("ru = 'Процедура ЗаполнитьСтатусыЗаказовПокупателей обработала очередную порцию заказов покупателей: 50'"));
	КонецЕсли;
	
КонецПроцедуры

// Заполняет значение нового реквизита СтатусЗаказ у переданного документа.
//
Процедура ЗаполнитьСтатусЗаказаПокупателя(ЗаказПокупателя)
	
	НачатьТранзакцию();
	Попытка
	
		// Блокируем объект от изменения другими сеансами.
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ._ДемоЗаказПокупателя");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ЗаказПокупателя.Ссылка);
		Блокировка.Заблокировать();
		
		ДокументОбъект = ЗаказПокупателя.Ссылка.ПолучитьОбъект();
		
		// Если объект ранее был удален или обработан другими сеансами, пропускаем его.
		Если ДокументОбъект = Неопределено Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		Если ДокументОбъект.СтатусЗаказа <> Перечисления._ДемоСтатусыЗаказовПокупателей.ПустаяСсылка() Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		// Обработка объекта.
		Если Не ДокументОбъект.УдалитьЗаказЗакрыт И Не ДокументОбъект.Проведен Тогда
			ДокументОбъект.СтатусЗаказа = Перечисления._ДемоСтатусыЗаказовПокупателей.НеСогласован;
		ИначеЕсли Не ДокументОбъект.УдалитьЗаказЗакрыт И ДокументОбъект.Проведен Тогда
			ДокументОбъект.СтатусЗаказа = Перечисления._ДемоСтатусыЗаказовПокупателей.Согласован;
		Иначе
			ДокументОбъект.СтатусЗаказа = Перечисления._ДемоСтатусыЗаказовПокупателей.Закрыт;
		КонецЕсли;
		
		// Запись обработанного объекта.
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Обновить значение реквизита ПериодРегистрации
//
Процедура ОбновитьПериодРегистрацииДокументовРасчета(Параметры) Экспорт
	
	Запрос = Новый Запрос(" 
		|ВЫБРАТЬ ПЕРВЫЕ 50
		|	_ДемоНачислениеЗарплаты.Ссылка КАК Ссылка
		|ИЗ
		|	Документ._ДемоНачислениеЗарплаты КАК _ДемоНачислениеЗарплаты
		|ГДЕ
		|	_ДемоНачислениеЗарплаты.ПериодРегистрации = ДАТАВРЕМЯ(1, 1, 1)
		|");
		
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	КоличествоОшибок = 0;
	Обработано       = 0;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументРасчета = Выборка.Ссылка;
		Попытка
			ЗаполнитьПериодРегистрацииДокументаРасчета(ДокументРасчета);
			Обработано = Обработано + 1;
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось обработать документ расчета %1 по причине %2'"), 
					ДокументРасчета, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
				ДокументРасчета.Метаданные(), ДокументРасчета, ТекстСообщения);
				
			КоличествоОшибок = КоличествоОшибок + 1;
		КонецПопытки;
	КонецЦикла;
	
	Если Обработано = 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процедуре ""ОбновитьПериодРегистрацииДокументовРасчета"" не удалось обработать некоторые документы расчета (пропущены): %1'"), 
				КоличествоОшибок);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
		Метаданные.Документы._ДемоЗаказПокупателя,,
			НСтр("ru = 'Процедура ""ОбновитьПериодРегистрацииДокументовРасчета"" обработала очередную порцию документов расчета: 50'"));
КонецПроцедуры

// Заполняет значение нового реквизита ПериодРегистрации у документа расчета
//
Процедура ЗаполнитьПериодРегистрацииДокументаРасчета(Знач ДокументРасчета)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить( ДокументРасчета.Метаданные().ПолноеИмя() );
	ЭлементБлокировки.УстановитьЗначение("Ссылка", ДокументРасчета);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		ДокументОбъект = ДокументРасчета.ПолучитьОбъект();
		Если ДокументОбъект <> Неопределено                	// Не удален
			И ДокументОбъект.ПериодРегистрации = '00010101'	// Не изменен
		Тогда
			// Заполняем корректным значением
			ДокументОбъект.ПериодРегистрации = ДокументОбъект.Дата;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Восстанавливает движения проведенных документов
//
Процедура ВосстановитьДвиженияДокументов(Параметры) Экспорт
	
	Запрос = Новый Запрос(" 
		|ВЫБРАТЬ ПЕРВЫЕ 100
		|	ПорцияДляОбработки.Ссылка          КАК Ссылка,
		|	ПорцияДляОбработки.РегистрДвижений КАК РегистрДвижений
		|ИЗ (
		|
		|	ВЫБРАТЬ ПЕРВЫЕ 100
		|		Документы.Ссылка  КАК Ссылка,
		|		""_ДемоОсновной"" КАК РегистрДвижений
		|	ИЗ
		|		Документ._ДемоПоступлениеТоваров КАК Документы,
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Документ._ДемоПоступлениеТоваров.Товары КАК ИсточникДвижений
		|	ПО 
		|		ИсточникДвижений.Ссылка = Документы.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		РегистрБухгалтерии._ДемоОсновной КАК Движения
		|	ПО 
		|		Движения.Регистратор ССЫЛКА Документ._ДемоПоступлениеТоваров
		|		И Документы.Ссылка = Движения.Регистратор
		|	ГДЕ
		|		Документы.Проведен
		|	СГРУППИРОВАТЬ ПО
		|		Документы.Ссылка
		|	ИМЕЮЩИЕ
		|		КОЛИЧЕСТВО(Движения.Регистратор) = 0
		|
		|	ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ПЕРВЫЕ 100
		|		Документы.Ссылка  КАК Ссылка,
		|		""_ДемоОсновной"" КАК РегистрДвижений
		|	ИЗ
		|		Документ._ДемоРеализацияТоваров КАК Документы,
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Документ._ДемоРеализацияТоваров.Товары КАК ИсточникДвижений
		|	ПО 
		|		ИсточникДвижений.Ссылка = Документы.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		РегистрБухгалтерии._ДемоОсновной КАК Движения
		|	ПО 
		|		Движения.Регистратор ССЫЛКА Документ._ДемоРеализацияТоваров
		|		И Документы.Ссылка = Движения.Регистратор
		|	ГДЕ
		|		Документы.Проведен
		|	СГРУППИРОВАТЬ ПО
		|		Документы.Ссылка
		|	ИМЕЮЩИЕ
		|		КОЛИЧЕСТВО(Движения.Регистратор) = 0
		|
		|	ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ПЕРВЫЕ 100
		|		Документы.Ссылка            КАК Ссылка,
		|		""_ДемоОсновныеНачисления"" КАК РегистрДвижений
		|	ИЗ
		|		Документ._ДемоНачислениеЗарплаты КАК Документы,
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Документ._ДемоНачислениеЗарплаты.Зарплата КАК ИсточникДвижений
		|	ПО 
		|		ИсточникДвижений.Ссылка = Документы.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		РегистрРасчета._ДемоОсновныеНачисления КАК Движения
		|	ПО 
		|		Движения.Регистратор ССЫЛКА Документ._ДемоНачислениеЗарплаты
		|		И Документы.Ссылка = Движения.Регистратор
		|	ГДЕ
		|		Документы.Проведен
		|	СГРУППИРОВАТЬ ПО
		|		Документы.Ссылка
		|	ИМЕЮЩИЕ
		|		КОЛИЧЕСТВО(Движения.Регистратор) = 0
		|
		|) КАК ПорцияДляОбработки
		|");
		
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	КоличествоОшибок = 0;
	Обработано       = 0;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекущийДокумент = Выборка.Ссылка;
		Попытка
			ВосстановитьДвиженияДокумента(ТекущийДокумент, Выборка.РегистрДвижений);
			Обработано = Обработано + 1;
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось восстановить движения документа %1 по причине %2'"), 
					ТекущийДокумент, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
				ТекущийДокумент.Метаданные(), ТекущийДокумент, ТекстСообщения);
				
			КоличествоОшибок = КоличествоОшибок + 1;
		КонецПопытки;
	КонецЦикла;
	
	Если Обработано = 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процедуре ""ВосстановитьДвиженияДокументов"" не удалось обработать некоторые документы (пропущены): %1'"), 
				КоличествоОшибок);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация, , ,
		НСтр("ru = 'Процедура ""ВосстановитьДвиженияДокументов"" обработала очередную порцию документов: 100'"));
	
КонецПроцедуры

// Перепроводит один документ, если тот еще не обработан
//
Процедура ВосстановитьДвиженияДокумента(Знач ТекущийДокумент, Знач РегистрДвижений)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить( ТекущийДокумент.Метаданные().ПолноеИмя() );
	ЭлементБлокировки.УстановитьЗначение("Ссылка", ТекущийДокумент);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		ДокументОбъект = ТекущийДокумент.ПолучитьОбъект();
		Если ДокументОбъект <> Неопределено И ДокументОбъект.Движения[РегистрДвижений].Количество() = 0 Тогда
			// Не удален и все еще нет движений
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Заполняет корректными данными измерения последовательности документов движения товаров
//
Процедура ЗаполнитьПоследовательностьДвиженияТоваров(Параметры) Экспорт 
	
	Запрос = Новый Запрос(" 
		|// Размер порции рассчитывается по документам. В порции будет обработано 5*4 = 20 документов максимум. 
		|// Каждый документ может относится к нескольким записям, поэтому количество записей порции может быть разным.
		|
		|ВЫБРАТЬ
		|	ПорцияОбработки.Ссылка               КАК Ссылка,
		|	ПорцияОбработки.Ссылка.Дата          КАК Период,
		|	ПорцияОбработки.Ссылка.МоментВремени КАК МоментВремени,
		|	
		|	ПорцияОбработки.Номенклатура  КАК Номенклатура,
		|	ПорцияОбработки.МестоХранения КАК МестоХранения
		|ИЗ (
		|
		|	// Некорректное по поступлениям
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Поступление.Ссылка               КАК Ссылка,
		|		Поступление.Номенклатура         КАК Номенклатура,
		|		Поступление.Ссылка.МестоХранения КАК МестоХранения
		|	ИЗ
		|		Документ._ДемоПоступлениеТоваров.Товары КАК Поступление
		|	ГДЕ
		|		Поступление.Ссылка В (
		|			ВЫБРАТЬ ПЕРВЫЕ 5
		|				Заполняемое.Регистратор
		|			ИЗ
		|				Последовательность._ДемоДвижениеТоваров КАК Заполняемое
		|			ГДЕ
		|				Заполняемое.Регистратор ССЫЛКА Документ._ДемоПоступлениеТоваров
		|				И (
		|					Заполняемое.Номенклатура = ЗНАЧЕНИЕ(Справочник._ДемоНоменклатура.ПустаяСсылка)
		|					ИЛИ 
		|					Заполняемое.МестоХранения = ЗНАЧЕНИЕ(Справочник._ДемоМестаХранения.ПустаяСсылка)
		|				)
		|			ОБЪЕДИНИТЬ ВСЕ 
		|			ВЫБРАТЬ ПЕРВЫЕ 5
		|				Поступление.Ссылка
		|			ИЗ
		|				Документ._ДемоПоступлениеТоваров.Товары КАК Поступление
		|			ЛЕВОЕ СОЕДИНЕНИЕ
		|				Последовательность._ДемоДвижениеТоваров КАК Заполняемое
		|			ПО
		|				ВЫРАЗИТЬ(Заполняемое.Регистратор КАК Документ._ДемоПоступлениеТоваров) = Поступление.Ссылка
		|			ГДЕ
		|				Заполняемое.Регистратор ЕСТЬ NULL
		|		)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	// Некорректное по реализации
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Реализация.Ссылка               КАК Ссылка,
		|		Реализация.Номенклатура         КАК Номенклатура,
		|		Реализация.Ссылка.МестоХранения КАК МестоХранения
		|	ИЗ
		|		Документ._ДемоРеализацияТоваров.Товары КАК Реализация
		|	ГДЕ
		|		Реализация.Ссылка В (
		|			ВЫБРАТЬ ПЕРВЫЕ 5
		|				Заполняемое.Регистратор
		|			ИЗ
		|				Последовательность._ДемоДвижениеТоваров КАК Заполняемое
		|			ГДЕ
		|				Заполняемое.Регистратор ССЫЛКА Документ._ДемоРеализацияТоваров
		|				И (
		|					Заполняемое.Номенклатура = ЗНАЧЕНИЕ(Справочник._ДемоНоменклатура.ПустаяСсылка)
		|					ИЛИ 
		|					Заполняемое.МестоХранения = ЗНАЧЕНИЕ(Справочник._ДемоМестаХранения.ПустаяСсылка)
		|				)
		|			ОБЪЕДИНИТЬ ВСЕ 
		|			ВЫБРАТЬ ПЕРВЫЕ 5
		|				Реализация.Ссылка
		|			ИЗ
		|				Документ._ДемоРеализацияТоваров.Товары КАК Реализация
		|			ЛЕВОЕ СОЕДИНЕНИЕ
		|				Последовательность._ДемоДвижениеТоваров КАК Заполняемое
		|			ПО
		|				ВЫРАЗИТЬ(Заполняемое.Регистратор КАК Документ._ДемоРеализацияТоваров) = Реализация.Ссылка
		|			ГДЕ
		|				Заполняемое.Регистратор ЕСТЬ NULL
		|		)
		|		
		|) КАК ПорцияОбработки
		|
		|ИТОГИ ПО
		|	Ссылка
		|");
		
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	КоличествоОшибок = 0;
	Обработано       = 0;
	
	// Обходим верхний уровень выборки - документ-источник
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДокументовПорции = Выборка.Количество();
	
	Пока Выборка.Следующий() Цикл
		ТекущийДокумент = Выборка.Ссылка;
		ВыборкаНабора   = Выборка.Выбрать();
		Попытка
			ЗаполнитьЗаписиДвиженияТоваровДокумента(ТекущийДокумент, ВыборкаНабора);
			Обработано = Обработано + 1;
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось заполнить последовательность движений товаров для документа %1 по причине %2'"), 
					ТекущийДокумент, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
				ТекущийДокумент.Метаданные(), ТекущийДокумент, ТекстСообщения);
				
			КоличествоОшибок = КоличествоОшибок + 1;
		КонецПопытки;
	КонецЦикла;
	
	Если Обработано = 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процедуре ""ЗаполнитьПоследовательностьДвиженияТоваров"" не удалось обработать некоторые документы (пропущены): %1'"), 
				КоличествоОшибок);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Процедура ""ЗаполнитьПоследовательностьДвиженияТоваров"" обработала очередную порцию документов: %1'"),
		ДокументовПорции);
		
	ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);
КонецПроцедуры

// Заполняет данными записи последовательности документов движения товаров
//
Процедура ЗаполнитьЗаписиДвиженияТоваровДокумента(Знач Ссылка, Знач ВыборкаНабора)
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить( Ссылка.Метаданные().ПолноеИмя() );
	ЭлементБлокировки.УстановитьЗначение("Ссылка", Ссылка);
	
	ЭлементБлокировки = Блокировка.Добавить("Последовательность._ДемоДвижениеТоваров.НаборЗаписей");
	ЭлементБлокировки.УстановитьЗначение("Регистратор", Ссылка);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		ДокументОбъект = Ссылка.ПолучитьОбъект();
		Если ДокументОбъект <> Неопределено Тогда
			// Документ не удален
			
			Набор = Последовательности._ДемоДвижениеТоваров.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Ссылка);
			Пока ВыборкаНабора.Следующий() Цикл
				 ЗаполнитьЗначенияСвойств(Набор.Добавить(), ВыборкаНабора);
			КонецЦикла;
			Набор.Записать(Истина);
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
		
КонецПроцедуры

// Тестовые обработчики отложенного обновления

// Тестовый обработчик отложенного обновления.
//
Процедура ТестированиеОтложенногоОбновления(Параметры) Экспорт
	
	ИмитироватьОшибку = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ОтложенноеОбновлениеИБ", "ИмитироватьОшибку");
	Если ИмитироватьОшибку = Истина Тогда
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ОтложенноеОбновлениеИБ", "ИмитироватьОшибку", Ложь);
		ВызватьИсключение НСтр("ru = 'Процедура ТестированиеОтложенногоОбновления завершилась с ошибкой.'");
	КонецЕсли;
	
КонецПроцедуры

// Пример перехода с конфигурации с именем "БиблиотекаСтандартныхПодсистемДемоБазовая".
// 
Процедура ПерейтиСБазовойВерсииНаПРОФ() Экспорт
	
	ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,,,
		НСтр("ru = 'Выполнен обработчик перехода ПерейтиСБазовойВерсииНаПРОФ'", Метаданные.ОсновнойЯзык.КодЯзыка));
	
КонецПроцедуры

#КонецОбласти
